"SPC Password" = "Mot de passe SPC";
"Authentication Key" = "Clé d’authentification";
"Incorrect key" = "Clé incorrecte";
"Incorrect SPC Password" = "Mot de passe SPC incorrect";
"Enter 26 digit key" = "Saisissez une clé d’authentification de 26 chiffres.";
"Security" = "Sécurité";
"Too many retries of SPC." = "Trop d’essais de SPC.";
"AKEY set successfully." = "AKEY définie correctement.";
"Failed to set AKEY." = "Échec de la définition de AKEY.";
"Too many retries of AKEY." = "Trop d’essais de AKEY.";
"Password" = "Mot de passe";
"Key" = "Clé";
"OK" = "OK";
"Cancel" = "Annuler";